Австралия/src/DataProcessors/ProductsSelection/ProductsSelection.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ProductsSelection</name>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.DiscountTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PricePeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AmountIncludesVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKindCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsType</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>OwnerFormUUID</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>DynamicPriceKindPercent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DynamicPriceKindBasic</name>
    <type>
      <types>CatalogRef.PriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountCard</name>
    <type>
      <types>CatalogRef.DiscountCards</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountPercentByDiscountCard</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalItems</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PriceCalculationMethod</name>
    <type>
      <types>EnumRef.PriceCalculationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>Cell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ShoppingCart</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Factor</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DiscountMarkupPercent</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.VATRates</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IsBundle</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>CrossReference</name>
      <type>
        <types>CatalogRef.SuppliersProducts</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Австралия/src/DataProcessors/ProductsSelection/Forms/InformationAboutDocument/Module.bsl
#Region ServiceProceduresAndFunctions
//

&AtServer
// Procedure fills the decoration with the list of product types
//
Procedure FillProductsTypeLabel(ProductsType)
	
	For Each ItemOfList In ProductsType Do
		
		Items.DecorationProductsTypeContent.Title = Items.DecorationProductsTypeContent.Title + ?(IsBlankString(Items.DecorationProductsTypeContent.Title), "", ", ") + ItemOfList.Value;
		
	EndDo;
	
EndProcedure

#EndRegion

#Region ProcedureFormEventHandlers
//

&AtServer
// Procedure - handler of the OnCreateAtServer event
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Not Parameters.Property("DiscountsMarkupsVisible") Then
		Raise NStr("en = 'Cannot open the product selection form this way. Open it from a business document.
				|For instance, in a Sales invoice, click Select > Goods.'; 
				|ru = 'Не удалось открыть форму выбора номенклатуры таким способом. Откройте ее из коммерческого документа.
				|Например, в инвойсе покупателю нажмите Выбрать > Товары.';
				|pl = 'W ten sposób nie można otworzyć formularza wyboru produktu. Otwórz go z dokumentu biznesowego.
				|Na przykład, w fakturze sprzedaży, kliknij Wybierz > Towary.';
				|es_ES = 'No se puede abrir el formulario de selección de productos de esta manera. Ábralo desde un documento comercial.
				|Por ejemplo, en una Factura de venta, haga clic en Seleccionar > Bienes.';
				|es_CO = 'No se puede abrir el formulario de selección de productos de esta manera. Ábralo desde un documento comercial.
				|Por ejemplo, en una Factura de venta, haga clic en Seleccionar > Bienes.';
				|tr = 'Ürün seçim formu bu şekilde açılamıyor. Formu bir ticari belgeden açın.
				|Örneğin, bir satış faturasında Seç > Mallar''a tıklayın.';
				|it = 'Impossibile aprire il modulo di selezione articolo in questo modo. Aprirlo da documento aziendale.
				|Ad esempio, in Fattura di vendita, cliccare su Seleziona > Merci.';
				|de = 'Fehler beim Öffnen des Formulars der Produktauswahl auf diesem Weg. Öffnen Sie es aus einem Geschäftsdokument.
				|Z. B., klicken Sie in einer Verkaufsrechnung auf Auswählen > Waren.'"); 
	EndIf;
	
	FillPropertyValues(Object, Parameters);
	
	FillProductsTypeLabel(Object.ProductsType);
	
	CommonClientServer.SetFormItemProperty(Items, "Company", "Visible", GetFunctionalOption("UseSeveralCompanies"));
	CommonClientServer.SetFormItemProperty(Items, "StructuralUnit", "Visible", GetFunctionalOption("UseSeveralWarehouses"));
	CommonClientServer.SetFormItemProperty(Items, "DiscountMarkupKind", "Visible", Parameters.DiscountsMarkupsVisible);
	
EndProcedure
 

#EndRegion
